// See https://aka.ms/new-console-template for more information

using System.Runtime.CompilerServices;

Console.WriteLine($"Домашне завдання #1");
Console.WriteLine();
Console.WriteLine($"Ця програма створює псевдографiчне представлення слiв, введених користувачем.{Environment.NewLine}P.S.: Необхiдно використовувати лише лiтери англiйського алфавiту");
Console.WriteLine();
Console.WriteLine($@"Приклад для слова ""SERGII"":");
Console.WriteLine("__$$$$$$$$$$____$$$$$$$$$$$$$$__$$$$$$$$$$$$______$$$$$$$$$$____$$$$$$__$$$$$$__");
Console.WriteLine("$$__________$$__$$______________$$__________$$__$$__________$$____$$______$$____");
Console.WriteLine("$$______________$$______________$$__________$$__$$________________$$______$$____");
Console.WriteLine("__$$$$$$$$$$____$$$$$$$$$$______$$$$$$$$$$$$____$$____$$$$$$$$____$$______$$____");
Console.WriteLine("____________$$__$$______________$$______$$______$$__________$$____$$______$$____");
Console.WriteLine("$$__________$$__$$______________$$________$$____$$__________$$____$$______$$____");
Console.WriteLine("__$$$$$$$$$$____$$$$$$$$$$$$$$__$$__________$$____$$$$$$$$$$____$$$$$$__$$$$$$__");


Console.WriteLine();
Console.WriteLine($@"Приклад для слова ""LOVE"":");
Console.WriteLine("$$$_____$$$$$$$_$$$$$$$_$$$_______$$$_$$$$$$$$$$");
Console.WriteLine("$$$____$$$____$$$____$$$_$$$_____$$$__$$$_______");
Console.WriteLine("$$$____$$$_____$_____$$$_$$$_____$$$__$$$_______");
Console.WriteLine("$$$_____$$$_________$$$___$$$___$$$___$$$$$$$$__");
Console.WriteLine("$$$______$$$_______$$$_____$$$_$$$____$$$_______");
Console.WriteLine("$$$_______$$$_____$$$______$$$_$$$____$$$_______");
Console.WriteLine("$$$$$$$$$___$$$$$$$_________$$$$$_____$$$$$$$$$$");


Console.WriteLine();
Console.WriteLine($@"Введiть слово:");

string? word = string.Empty;
word = Console.ReadLine();
if (!string.IsNullOrWhiteSpace(word))
{
    word = word.Trim();
    Dictionary<string, Dictionary<int, string>> alphabetPseudographicLines = new Dictionary<string, Dictionary<int, string>> ();
    string space = "__";
    alphabetPseudographicLines.Add("q", new Dictionary<int, string>() { { 1, "__$$$$$$$$$$____" }, { 2, "$$__________$$__" }, { 3, "$$__________$$__" }, { 4, "$$__________$$__" }, { 5, "$$______$$__$$__" }, { 6, "$$________$$____" }, { 7, "__$$$$$$$$__$$__" } });
    alphabetPseudographicLines.Add("w", new Dictionary<int, string>() { { 1, "$$__________$$__" }, { 2, "$$____$$____$$__" }, { 3, "$$____$$____$$__" }, { 4, "$$____$$____$$__" }, { 5, "$$____$$____$$__" }, { 6, "$$____$$____$$__" }, { 7, "__$$$$__$$$$____" } });
    alphabetPseudographicLines.Add("e", new Dictionary<int, string>() { { 1, "$$$$$$$$$$$$$$__" }, { 2, "$$______________" }, { 3, "$$______________" }, { 4, "$$$$$$$$$$______" }, { 5, "$$______________" }, { 6, "$$______________" }, { 7, "$$$$$$$$$$$$$$__" } });
    alphabetPseudographicLines.Add("r", new Dictionary<int, string>() { { 1, "$$$$$$$$$$$$____" }, { 2, "$$__________$$__" }, { 3, "$$__________$$__" }, { 4, "$$$$$$$$$$$$____" }, { 5, "$$______$$______" }, { 6, "$$________$$____" }, { 7, "$$__________$$__" } });
    alphabetPseudographicLines.Add("t", new Dictionary<int, string>() { { 1, "$$$$$$$$$$$$$$__" }, { 2, "______$$________" }, { 3, "______$$________" }, { 4, "______$$________" }, { 5, "______$$________" }, { 6, "______$$________" }, { 7, "______$$________" } });
    alphabetPseudographicLines.Add("y", new Dictionary<int, string>() { { 1, "$$__________$$__" }, { 2, "__$$______$$____" }, { 3, "____$$__$$______" }, { 4, "______$$________" }, { 5, "______$$________" }, { 6, "______$$________" }, { 7, "______$$________" } });
    alphabetPseudographicLines.Add("u", new Dictionary<int, string>() { { 1, "$$__________$$__" }, { 2, "$$__________$$__" }, { 3, "$$__________$$__" }, { 4, "$$__________$$__" }, { 5, "$$__________$$__" }, { 6, "$$__________$$__" }, { 7, "__$$$$$$$$$$____" } });
    alphabetPseudographicLines.Add("i", new Dictionary<int, string>() { { 1, "$$$$$$__" }, { 2, "__$$____" }, { 3, "__$$____" }, { 4, "__$$____" }, { 5, "__$$____" }, { 6, "__$$____" }, { 7, "$$$$$$__" } });
    alphabetPseudographicLines.Add("o", new Dictionary<int, string>() { { 1, "$$$$$$$$$$$$$$__" }, { 2, "$$__________$$__" }, { 3, "$$__________$$__" }, { 4, "$$__________$$__" }, { 5, "$$__________$$__" }, { 6, "$$__________$$__" }, { 7, "$$$$$$$$$$$$$$__" } });
    alphabetPseudographicLines.Add("p", new Dictionary<int, string>() { { 1, "$$$$$$$$$$$$____" }, { 2, "$$__________$$__" }, { 3, "$$__________$$__" }, { 4, "$$$$$$$$$$$$____" }, { 5, "$$______________" }, { 6, "$$______________" }, { 7, "$$______________" } });
    alphabetPseudographicLines.Add("a", new Dictionary<int, string>() { { 1, "______$$________" }, { 2, "____$$__$$______" }, { 3, "__$$______$$____" }, { 4, "$$__________$$__" }, { 5, "$$$$$$$$$$$$$$__" }, { 6, "$$__________$$__" }, { 7, "$$__________$$__" } });
    alphabetPseudographicLines.Add("s", new Dictionary<int, string>() { { 1, "__$$$$$$$$$$____" }, { 2, "$$__________$$__" }, { 3, "$$______________" }, { 4, "__$$$$$$$$$$____" }, { 5, "____________$$__" }, { 6, "$$__________$$__" }, { 7, "__$$$$$$$$$$____" } });
    alphabetPseudographicLines.Add("d", new Dictionary<int, string>() { { 1, "$$$$$$$$$$$$____" }, { 2, "$$__________$$__" }, { 3, "$$__________$$__" }, { 4, "$$__________$$__" }, { 5, "$$__________$$__" }, { 6, "$$__________$$__" }, { 7, "$$$$$$$$$$$$____" } });
    alphabetPseudographicLines.Add("f", new Dictionary<int, string>() { { 1, "$$$$$$$$$$$$$$__" }, { 2, "$$______________" }, { 3, "$$______________" }, { 4, "$$$$$$$$$$______" }, { 5, "$$______________" }, { 6, "$$______________" }, { 7, "$$______________" } });
    alphabetPseudographicLines.Add("g", new Dictionary<int, string>() { { 1, "__$$$$$$$$$$____" }, { 2, "$$__________$$__" }, { 3, "$$______________" }, { 4, "$$____$$$$$$$$__" }, { 5, "$$__________$$__" }, { 6, "$$__________$$__" }, { 7, "__$$$$$$$$$$____" } });
    alphabetPseudographicLines.Add("h", new Dictionary<int, string>() { { 1, "$$__________$$__" }, { 2, "$$__________$$__" }, { 3, "$$__________$$__" }, { 4, "$$$$$$$$$$$$$$__" }, { 5, "$$__________$$__" }, { 6, "$$__________$$__" }, { 7, "$$__________$$__" } });
    alphabetPseudographicLines.Add("j", new Dictionary<int, string>() { { 1, "____________$$__" }, { 2, "____________$$__" }, { 3, "____________$$__" }, { 4, "____________$$__" }, { 5, "$$__________$$__" }, { 6, "$$__________$$__" }, { 7, "__$$$$$$$$$$____" } });
    alphabetPseudographicLines.Add("k", new Dictionary<int, string>() { { 1, "$$________$$__" }, { 2, "$$______$$____" }, { 3, "$$____$$______" }, { 4, "$$$$$$________" }, { 5, "$$____$$______" }, { 6, "$$______$$____" }, { 7, "$$________$$__" } });
    alphabetPseudographicLines.Add("l", new Dictionary<int, string>() { { 1, "$$______________" }, { 2, "$$______________" }, { 3, "$$______________" }, { 4, "$$______________" }, { 5, "$$______________" }, { 6, "$$______________" }, { 7, "$$$$$$$$$$$$$$__" } });
    alphabetPseudographicLines.Add("z", new Dictionary<int, string>() { { 1, "$$$$$$$$$$$$$$__" }, { 2, "__________$$____" }, { 3, "________$$______" }, { 4, "______$$________" }, { 5, "____$$__________" }, { 6, "__$$____________" }, { 7, "$$$$$$$$$$$$$$__" } });
    alphabetPseudographicLines.Add("x", new Dictionary<int, string>() { { 1, "$$__________$$__" }, { 2, "__$$______$$____" }, { 3, "____$$__$$______" }, { 4, "______$$________" }, { 5, "____$$__$$______" }, { 6, "__$$______$$____" }, { 7, "$$__________$$__" } });
    alphabetPseudographicLines.Add("c", new Dictionary<int, string>() { { 1, "__$$$$$$$$$$____" }, { 2, "$$__________$$__" }, { 3, "$$______________" }, { 4, "$$______________" }, { 5, "$$______________" }, { 6, "$$__________$$__" }, { 7, "__$$$$$$$$$$____" } });
    alphabetPseudographicLines.Add("v", new Dictionary<int, string>() { { 1, "$$__________$$__" }, { 2, "$$__________$$__" }, { 3, "$$__________$$__" }, { 4, "$$__________$$__" }, { 5, "__$$______$$____" }, { 6, "____$$__$$______" }, { 7, "______$$________" } });
    alphabetPseudographicLines.Add("b", new Dictionary<int, string>() { { 1, "$$$$$$$$$$$$____" }, { 2, "$$__________$$__" }, { 3, "$$__________$$__" }, { 4, "$$$$$$$$$$$$____" }, { 5, "$$__________$$__" }, { 6, "$$__________$$__" }, { 7, "$$$$$$$$$$$$____" } });
    alphabetPseudographicLines.Add("n", new Dictionary<int, string>() { { 1, "$$__________$$__" }, { 2, "$$$$________$$__" }, { 3, "$$__$$______$$__" }, { 4, "$$____$$____$$__" }, { 5, "$$______$$__$$__" }, { 6, "$$________$$$$__" }, { 7, "$$__________$$__" } });
    alphabetPseudographicLines.Add("m", new Dictionary<int, string>() { { 1, "$$__________$$__" }, { 2, "$$$$______$$$$__" }, { 3, "$$__$$__$$__$$__" }, { 4, "$$____$$____$$__" }, { 5, "$$__________$$__" }, { 6, "$$__________$$__" }, { 7, "$$__________$$__" } });


    Dictionary<int, string> lines = new Dictionary<int, string>() { { 1, string.Empty }, { 2, string.Empty }, { 3, string.Empty }, { 4, string.Empty }, { 5, string.Empty }, { 6, string.Empty }, { 7, string.Empty } };
    foreach (char letter in word)
    {
        bool flAddSpace = !string.IsNullOrEmpty(lines[1]);
       for(int i=1; i<=7;i++)
        {
            if (flAddSpace) lines[i] = $"{lines[i]}{space}";
            lines[i] = $"{lines[i]}{alphabetPseudographicLines[letter.ToString().Trim().ToLower()][i]}";
        }
    }

    for (int i = 1; i <= 7; i++)
    {
        Console.WriteLine($"{lines[i]}");
    }

    Console.ReadLine();
}





Console.ReadLine();


